## [helm-base-chart-shared](https://coopnorge.app.spacelift.io/stack/helm-base-chart-shared/run/01J2KPBMWA8M61QAMX7Y7FQ47B) plan logs

<details>
<summary>Click here to expand</summary>

```
[01J2JN0VBKREN15C6AQPS9JMPW] Planning changes with 1 custom hook...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.coop-helm-chart-repo will be created
  + resource "google_artifact_registry_repository" "coop-helm-chart-repo" {
      + create_time      = (known after apply)
      + description      = "Helm charts used in coop"
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "europe-north1-b"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "helmbasecharts-shared-5ebb"
      + repository_id    = "coop-helm-charts"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)
    }

  # google_artifact_registry_repository_iam_member.public-artifacts-reader will be created
  + resource "google_artifact_registry_repository_iam_member" "public-artifacts-reader" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe-north1-b"
      + member     = "allUsers"
      + project    = "helmbasecharts-shared-5ebb"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # google_project_service.project["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "project" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "helmbasecharts-shared-5ebb"
      + service                    = "artifactregistry.googleapis.com"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

[01J2JN0VBKREN15C6AQPS9JMPW] Changes are GO
[01J2JN0VBKREN15C6AQPS9JMPW] Uploading the list of managed resources...
[01J2JN0VBKREN15C6AQPS9JMPW] Generating Infracost JSON report from plan

[01J2JN0VBKREN15C6AQPS9JMPW] Infracost report generated successfully
[01J2JN0VBKREN15C6AQPS9JMPW] Mapping Infracost data to resources
[01J2JN0VBKREN15C6AQPS9JMPW] Costs mapped successfully
[01J2JN0VBKREN15C6AQPS9JMPW] Please be aware that the run changes calculation includes output changes.
[01J2JN0VBKREN15C6AQPS9JMPW] Resource list upload is GO
[01J2JN0VBKREN15C6AQPS9JMPW] Generating JSON representation of the plan...
[01J2JN0VBKREN15C6AQPS9JMPW] JSON representation is GO
[01J2JN0VBKREN15C6AQPS9JMPW] Generating Infracost JSON report from plan

[01J2JN0VBKREN15C6AQPS9JMPW] Infracost report generated successfully
[01J2JN0VBKREN15C6AQPS9JMPW] Loading custom plan policy inputs...
[01J2JN0VBKREN15C6AQPS9JMPW] 1 custom plan policy input found: plan
[01J2JN0VBKREN15C6AQPS9JMPW] Evaluated 2 plan policies
[01J2JN0VBKREN15C6AQPS9JMPW] Plan checks are GO
[01J2JN0VBKREN15C6AQPS9JMPW] Running 1 after-run hook
Found local state with MD5 957cecb1c8bfca3968924315f2a90a15
Found backuped state with MD5 957cecb1c8bfca3968924315f2a90a15
No difference in state file md5sum. Will not run a backup
```

</details>